In [1]:
import sqlite3

In [2]:
sqlite_db = 'houses.sqlite'

In [3]:
conn=sqlite3.connect(sqlite_db)
c=conn.cursor()

In [4]:
c.execute('CREATE TABLE houses (pk INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER)')

In [5]:
conn.commit()

In [8]:
last_sale = (None, 4000, 5, 22, 619000)
c.execute('INSERT INTO houses VALUES(?, ?, ?, ?, ?)', last_sale)

In [9]:
results = c.execute('SELECT * FROM houses;')

In [10]:
results.fetchall()

[(1, 4000, 5, 22, 619000)]

In [14]:
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

In [16]:
c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales)
conn.commit()

In [17]:
results = c.execute('SELECT * FROM houses;')
results.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000)]

In [18]:
from numpy import genfromtxt

In [22]:
data = (genfromtxt('../datasets/housing-data.csv', dtype='i8',
                  delimiter=',', skip_header=1 )).tolist()
data

[[2104, 3, 70, 399900],
 [1600, 3, 28, 329900],
 [2400, 3, 44, 369000],
 [1416, 2, 49, 232000],
 [3000, 4, 75, 539900],
 [1985, 4, 61, 299900],
 [1534, 3, 12, 314900],
 [1427, 3, 57, 198999],
 [1380, 3, 14, 212000],
 [1494, 3, 15, 242500],
 [1940, 4, 7, 239999],
 [2000, 3, 27, 347000],
 [1890, 3, 45, 329999],
 [4478, 5, 49, 699900],
 [1268, 3, 58, 259900],
 [2300, 4, 77, 449900],
 [1320, 2, 62, 299900],
 [1236, 3, 78, 199900],
 [2609, 4, 5, 499998],
 [3031, 4, 21, 599000],
 [1767, 3, 44, 252900],
 [1888, 2, 79, 255000],
 [1604, 3, 13, 242900],
 [1962, 4, 53, 259900],
 [3890, 3, 36, 573900],
 [1100, 3, 60, 249900],
 [1458, 3, 29, 464500],
 [2526, 3, 13, 469000],
 [2200, 3, 28, 475000],
 [2637, 3, 25, 299900],
 [1839, 2, 40, 349900],
 [1000, 1, 5, 169900],
 [2040, 4, 75, 314900],
 [3137, 3, 67, 579900],
 [1811, 4, 24, 285900],
 [1437, 3, 50, 249900],
 [1239, 3, 22, 229900],
 [2132, 4, 28, 345000],
 [4215, 4, 66, 549000],
 [2162, 4, 43, 287000],
 [1664, 2, 40, 368500],
 [2238, 3, 37, 329900],
 [2567, 4, 57, 314000],
 [1200, 3, 76, 299000],
 [852, 2, 70, 179900],
 [1852, 4, 64, 299900],
 [1203, 3, 11, 239500]]

In [25]:
for d in data:
    d.insert(0, None)
data[0:3]

[[None, 2104, 3, 70, 399900],
 [None, 1600, 3, 28, 329900],
 [None, 2400, 3, 44, 369000]]

In [26]:
for d in data:
    c.execute('INSERT INTO houses VALUES (?,?,?,?,?)',d)
conn.commit()

In [29]:
results=c.execute('SELECT * FROM houses;')
results.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000),
 (5, 2104, 3, 70, 399900),
 (6, 1600, 3, 28, 329900),
 (7, 2400, 3, 44, 369000),
 (8, 1416, 2, 49, 232000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (11, 1534, 3, 12, 314900),
 (12, 1427, 3, 57, 198999),
 (13, 1380, 3, 14, 212000),
 (14, 1494, 3, 15, 242500),
 (15, 1940, 4, 7, 239999),
 (16, 2000, 3, 27, 347000),
 (17, 1890, 3, 45, 329999),
 (18, 4478, 5, 49, 699900),
 (19, 1268, 3, 58, 259900),
 (20, 2300, 4, 77, 449900),
 (21, 1320, 2, 62, 299900),
 (22, 1236, 3, 78, 199900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (25, 1767, 3, 44, 252900),
 (26, 1888, 2, 79, 255000),
 (27, 1604, 3, 13, 242900),
 (28, 1962, 4, 53, 259900),
 (29, 3890, 3, 36, 573900),
 (30, 1100, 3, 60, 249900),
 (31, 1458, 3, 29, 464500),
 (32, 2526, 3, 13, 469000),
 (33, 2200, 3, 28, 475000),
 (34, 2637, 3, 25, 299900),
 (35, 1839, 2, 40, 349900),
 (36, 1000, 1, 5, 169900),
 (37, 2040, 4, 75, 314900),
 (38, 3137, 3, 67, 579900),
 (39, 1811, 4, 24, 285900),
 (40, 1437, 3, 50, 249900),
 (41, 1239, 3, 22, 229900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (45, 1664, 2, 40, 368500),
 (46, 2238, 3, 37, 329900),
 (47, 2567, 4, 57, 314000),
 (48, 1200, 3, 76, 299000),
 (49, 852, 2, 70, 179900),
 (50, 1852, 4, 64, 299900),
 (51, 1203, 3, 11, 239500)]

In [31]:
import pandas as pd
from pandas.io import sql

In [32]:
data = pd.read_csv('../datasets/housing-data.csv')
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [33]:
conn

In [34]:
data.to_sql('houses_pandas_are_cool',
            con=conn,
            if_exists='replace',
            index=False
           )

In [35]:
results = c.execute('SELECT * FROM houses_pandas_are_cool;')
results.fetchall()[0:5]

[(2104, 3, 70, 399900),
 (1600, 3, 28, 329900),
 (2400, 3, 44, 369000),
 (1416, 2, 49, 232000),
 (3000, 4, 75, 539900)]

In [36]:
this_data_came_from_sql=sql.read_sql('SELECT * FROM houses_pandas_are_cool;',con=conn)

In [38]:
this_data_came_from_sql.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [46]:
def helper_function(query):
    return sql.read_sql(query,con=conn)

In [48]:
helper_function("SELECT * FROM houses_pandas_are_cool")

    sqft  bdrms  age   price
0   2104      3   70  399900
1   1600      3   28  329900
2   2400      3   44  369000
3   1416      2   49  232000
4   3000      4   75  539900
5   1985      4   61  299900
6   1534      3   12  314900
7   1427      3   57  198999
8   1380      3   14  212000
9   1494      3   15  242500
10  1940      4    7  239999
11  2000      3   27  347000
12  1890      3   45  329999
13  4478      5   49  699900
14  1268      3   58  259900
15  2300      4   77  449900
16  1320      2   62  299900
17  1236      3   78  199900
18  2609      4    5  499998
19  3031      4   21  599000
20  1767      3   44  252900
21  1888      2   79  255000
22  1604      3   13  242900
23  1962      4   53  259900
24  3890      3   36  573900
25  1100      3   60  249900
26  1458      3   29  464500
27  2526      3   13  469000
28  2200      3   28  475000
29  2637      3   25  299900
30  1839      2   40  349900
31  1000      1    5  169900
32  2040      4   75  314900
33  3137      3   67  579900
34  1811      4   24  285900
35  1437      3   50  249900
36  1239      3   22  229900
37  2132      4   28  345000
38  4215      4   66  549000
39  2162      4   43  287000
40  1664      2   40  368500
41  2238      3   37  329900
42  2567      4   57  314000
43  1200      3   76  299000
44   852      2   70  179900
45  1852      4   64  299900
46  1203      3   11  239500

In [51]:
helper_function("SELECT * FROM houses_pandas_are_cool LIMIT 10")

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900
5  1985      4   61  299900
6  1534      3   12  314900
7  1427      3   57  198999
8  1380      3   14  212000
9  1494      3   15  242500

In [56]:
helper_function('SELECT * FROM houses WHERE bdrms = 4 LIMIT 5')

   pk  sqft  bdrms  age   price
0   2  2390      4   34  319000
1   9  3000      4   75  539900
2  10  1985      4   61  299900
3  15  1940      4    7  239999
4  20  2300      4   77  449900

In [57]:
helper_function('SELECT * FROM houses WHERE bdrms=4 AND price<300000')

   pk  sqft  bdrms  age   price
0  10  1985      4   61  299900
1  15  1940      4    7  239999
2  28  1962      4   53  259900
3  39  1811      4   24  285900
4  44  2162      4   43  287000
5  50  1852      4   64  299900

In [58]:
helper_function('SELECT COUNT(*) FROM houses')

   COUNT(*)
0        51

In [59]:
helper_function('SELECT AVG(sqft), MIN(price), MAX(price) FROM houses WHERE bdrms=2')

   AVG(sqft)  MIN(price)  MAX(price)
0     1496.5      179900      368500

In [61]:
helper_function('SELECT AVG(price) FROM houses WHERE bdrms=1')

   AVG(price)
0    169900.0

In [63]:
helper_function('SELECT AVG(price)/2 as per_bedroom FROM houses WHERE bdrms=2')

     per_bedroom
0  140433.333333

In [70]:
helper_function('SELECT bdrms, count(*) as count FROM houses GROUP BY bdrms ORDER BY count DESC')

   bdrms  count
0      3     27
1      4     15
2      2      6
3      5      2
4      1      1

In [71]:
helper_function('SELECT MAX(age) FROM houses WHERE bdrms=3')

   MAX(age)
0        90

In [73]:
helper_function('SELECT * FROM houses WHERE bdrms=3 and age=90')

   pk  sqft  bdrms  age   price
0   4  1505      3   90  269000

In [74]:
helper_function('SELECT MIN(age) FROM houses')

   MIN(age)
0         5

In [76]:
helper_function('SELECT bdrms, AVG(age) FROM houses GROUP BY bdrms')

   bdrms   AVG(age)
0      1   5.000000
1      2  56.666667
2      3  39.370370
3      4  46.000000
4      5  35.500000